Revit 2026 API
Solid.Faces Property
The faces that belong to the solid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public FaceArray Faces { get; }
Public ReadOnly Property Faces As FaceArray
	Get
public:
property FaceArray^ Faces {
	FaceArray^ get ();
}
member Faces : FaceArray with get
Property Value
FaceArray
Remarks
A face may be degenerate. This can be determined with the Face property IsTwoSided.
See Also
Reference
Solid Class
Autodesk.Revit.DB Namespace